AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
  config.zones[configIndex].desiredState = "CLOSED";
  applyZonesFromConfig();
  if (!waitForZoneMovement(zoneIndex)) {
    return false;
  }
  delay(SERVO_ENDPOINT_HOLD_MS);
  Serial.printf("Teste do servo da zona %d concluido.\n", zoneIndex);
  return true;
}

void countIrrigationPaths(int& controlledZones, int& openZones) {
  controlledZones = 0;
  openZones = 0;
  for (int i = 0; i < config.zoneCount; i++) {
    ZoneCfg& zone = config.zones[i];
    if (!zone.hasActuator || zone.actuator.driver != "ESP32_PWM" ||
        !isServoMappedToZone(zone.index, zone.actuator.channel)) {
      continue;
    }
    controlledZones++;
    int stateIdx = findZoneStateIndex(zone.index);
    if (stateIdx >= 0 && zoneStates[stateIdx].targetState == "OPEN" &&
        zoneStates[stateIdx].appliedState == "OPEN") {
      openZones++;
    }
  }
}

bool irrigationPathIsSafe() {
  int controlledZones;
  int openZones;
  countIrrigationPaths(controlledZones, openZones);
  if (controlledZones == 0 || openZones == 0) {
    return false;
  }
  return config.maxSimultaneousZones <= 0 ||
    openZones <= config.maxSimultaneousZones;
}

void applyIrrigationControl() {
  if (config.pumpMode == "FORCED_ON") {
    setPump(!manualPumpHoldOff && irrigationPathIsSafe());
    return;
  }
  if (config.pumpMode == "FORCED_OFF") {
    setPump(false);
    return;
  }
  if (config.operationMode == "OFF") {
    bool changed = false;
    for (int i = 0; i < config.zoneCount; i++) {
      if (config.zones[i].desiredState != "CLOSED") {
        config.zones[i].desiredState = "CLOSED";
        changed = true;
      }
    }
    if (changed) {
      applyZonesFromConfig();
    }
    setPump(false);
    return;
  }
  if (config.operationMode != "AUTO") {
    return;
  }

  // Cada area possui sua propria maquina de estados da rega automatica.
  bool zoneStateChanged = false;
  unsigned long now = millis();
  for (int i = 0; i < config.zoneCount; i++) {
    ZoneCfg& zone = config.zones[i];
    if (!zone.enabled || !zone.hasActuator ||
        !isServoMappedToZone(zone.index, zone.actuator.channel)) {
      continue;
    }

    int stateIdx = findZoneStateIndex(zone.index);
    if (stateIdx < 0) {
      continue;
    }
    ZoneState& state = zoneStates[stateIdx];

    // Uma rega manual permanece sob controle do usuario ate receber CLOSE_ZONE.
    if (state.manualOverride) {
      state.drySinceAt = 0;
      continue;
    }

    // Desativar a automacao ou perder o sensor sempre encerra um ciclo automatico.
    if (!zone.automationEnabled || zoneSoilMoisture[zone.index] < 0) {
      state.drySinceAt = 0;
      if (state.automationIrrigating) {
        state.automationIrrigating = false;
        state.lastIrrigationEndedAt = now;
        Serial.printf(
          "Rega AUTO S%d encerrada: %s.\n",
          zone.index + 1,
          zone.automationEnabled ? "sensor invalido" : "automacao desativada"
        );
      }
      if (zone.desiredState != "CLOSED") {
        zone.desiredState = "CLOSED";
        zoneStateChanged = true;
      }
      continue;
    }

    int moisture = zoneSoilMoisture[zone.index];
    if (state.automationIrrigating) {
      unsigned long elapsed = now - state.irrigationStartedAt;
      bool minimumReached = elapsed >=
        (unsigned long)zone.minimumIrrigationSeconds * 1000UL;
      bool maximumReached = elapsed >=
        (unsigned long)zone.maximumIrrigationSeconds * 1000UL;
      bool targetReached = minimumReached && moisture >= zone.moistureStopLimit;
      if (maximumReached || targetReached) {
        state.automationIrrigating = false;
        state.lastIrrigationEndedAt = now;
        state.drySinceAt = 0;
        zone.desiredState = "CLOSED";
        zoneStateChanged = true;
        Serial.printf(
          "Rega AUTO S%d encerrada: %s, umidade=%d%%, duracao=%lus.\n",
          zone.index + 1,
          maximumReached ? "tempo maximo" : "umidade alvo",
          moisture,
          elapsed / 1000UL
        );
      }
      continue;
    }

    // Corrige um OPEN antigo que nao pertence a ciclo automatico nem manual atual.
    if (zone.desiredState != "CLOSED") {
      zone.desiredState = "CLOSED";
      zoneStateChanged = true;
    }

    if (moisture >= zone.moistureLimit) {
      state.drySinceAt = 0;
      continue;
    }

    if (state.drySinceAt == 0) {
      state.drySinceAt = now;
    }
    bool dryConfirmed = now - state.drySinceAt >=
      (unsigned long)zone.dryConfirmationSeconds * 1000UL;
    bool cooldownReady = state.lastIrrigationEndedAt == 0 ||
      now - state.lastIrrigationEndedAt >=
        (unsigned long)zone.cooldownMinutes * 60000UL;
    if (dryConfirmed && cooldownReady) {
      state.automationIrrigating = true;
      state.irrigationStartedAt = now;
      state.drySinceAt = 0;
      zone.desiredState = "OPEN";
      zoneStateChanged = true;
      Serial.printf(
        "Rega AUTO S%d iniciada: umidade=%d%%, alvo=%d%%, max=%ds.\n",
        zone.index + 1,
        moisture,
        zone.moistureStopLimit,
        zone.maximumIrrigationSeconds
      );
    }
  }
  if (zoneStateChanged) {
    applyZonesFromConfig();
  }

  // A bomba so parte depois que pelo menos um registro terminou de abrir.
  // Durante a sequencia manual PUMP_OFF -> CLOSE_ZONE ela permanece bloqueada.
  setPump(!manualPumpHoldOff && irrigationPathIsSafe());
}

void applyPumpSafety() {
  if (!pumpOn) {
    return;
  }

  int controlledZones;
  int openZones;
  countIrrigationPaths(controlledZones, openZones);

  bool noOpenPath = controlledZones > 0 && openZones == 0;
  bool tooManyOpenZones = config.maxSimultaneousZones > 0 &&
    openZones > config.maxSimultaneousZones;
  if (noOpenPath || tooManyOpenZones) {
    setPump(false);
    if (tooManyOpenZones) {
      Serial.println("Bomba desligada: limite de zonas simultaneas excedido.");
    }
  }
}

// ============================================================
// CONFIGURACAO REMOTA
// ============================================================

bool syncConfigFromApi() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  String path = "/devices/" + deviceId + "/config";
  if (configLoaded && config.configVersion > 0) {
    path += "?configVersion=" + String(config.configVersion);
  }
  if (!beginHttp(http, path)) {
    lastHttpCode = 0;
    return false;
  }
  addDeviceAuthHeader(http);
  int code = http.GET();
  lastHttpCode = code;
  if (code == 304) {
    http.end();
    if (configLoaded) {
      return true;
    }
    // Nunca aceite 304 sem possuir as areas em RAM; force download completo.
    config.configVersion = 0;
    Serial.println("Config 304 sem cache local; solicitando configuracao completa.");
    return false;
  }
  if (code != 200) {
    Serial.printf("Falha no sync de config. HTTP %d\n", code);
    http.end();
    recoverDeviceRegistration(code, "Config");
    return false;
  }
  String response = http.getString();
  http.end();

  // Check the new standardized response format (success.data) or legacy
  DynamicJsonDocument doc(6144);
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    Serial.printf("JSON invalido no config: %s\n", error.c_str());
    return false;
  }

  // Handle both new (success.data) and legacy response formats
  JsonObject configData;
  if (doc["success"] == true && !doc["data"].isNull()) {
    configData = doc["data"].as<JsonObject>();
  } else {
    configData = doc.as<JsonObject>();
  }

