AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
  if (configData.isNull()) {
    Serial.println("Config: dados nao encontrados na resposta");
    return false;
  }

  config.operationMode = configData["operationMode"] | "AUTO";
  config.moistureLimit = configData["moistureThreshold"] | 35;
  config.heartbeatIntervalSeconds = max(
    1,
    configData["heartbeatIntervalSeconds"] | (int)(HEARTBEAT_INTERVAL_MS / 1000)
  );
  config.telemetryIntervalSeconds = max(
    1,
    configData["telemetryIntervalSeconds"] | (int)(TELEMETRY_INTERVAL_MS / 1000)
  );
  config.configSyncIntervalSeconds = max(
    1,
    configData["configSyncIntervalSeconds"] | (int)(CONFIG_SYNC_INTERVAL_MS / 1000)
  );
  config.pumpMode = configData["pumpMode"] | "AUTO";
  config.maxSimultaneousZones = configData["maxSimultaneousZones"] | 0;
  int newVersion = configData["configVersion"] | 0;
  JsonArray zonesArray = configData["zones"].as<JsonArray>();
  config.zoneCount = min((int)zonesArray.size(), MAX_ZONES);
  for (int i = 0; i < config.zoneCount; i++) {
    JsonObject z = zonesArray[i];
    config.zones[i].index = z["index"] | i;
    config.zones[i].name = z["name"] | "";
    config.zones[i].moistureLimit = constrain(
      z["moistureThreshold"] | config.moistureLimit,
      0,
      99
    );
    config.zones[i].automationEnabled = z["automationEnabled"] | true;
    config.zones[i].moistureStopLimit = constrain(
      z["moistureStopThreshold"] | min(100, config.zones[i].moistureLimit + 5),
      config.zones[i].moistureLimit + 1,
      100
    );
    config.zones[i].dryConfirmationSeconds = constrain(
      z["dryConfirmationSeconds"] | 10,
      0,
      300
    );
    config.zones[i].minimumIrrigationSeconds = constrain(
      z["minimumIrrigationSeconds"] | 15,
      0,
      600
    );
    config.zones[i].maximumIrrigationSeconds = constrain(
      z["maximumIrrigationSeconds"] | 300,
      max(10, config.zones[i].minimumIrrigationSeconds),
      3600
    );
    config.zones[i].cooldownMinutes = constrain(
      z["cooldownMinutes"] | 30,
      0,
      1440
    );
    config.zones[i].enabled = z["enabled"] | true;
    config.zones[i].desiredState = z["desiredState"] | "CLOSED";
    JsonObject act = z["actuator"];
    if (!act.isNull()) {
      config.zones[i].hasActuator = true;
      config.zones[i].actuator.driver = act["driver"] | "ESP32_PWM";
      config.zones[i].actuator.channel = act["channel"] | 0;
      config.zones[i].actuator.openAngle = act["openAngle"] | 90;
      config.zones[i].actuator.closedAngle = act["closedAngle"] | 10;
      config.zones[i].actuator.minPulseUs = act["minPulseUs"] | 500;
      config.zones[i].actuator.maxPulseUs = act["maxPulseUs"] | 2500;
      config.zones[i].actuator.inverted = act["inverted"] | false;
    } else {
      config.zones[i].hasActuator = false;
    }
  }
  saveConfigVersion(newVersion);
  applyZonesFromConfig();
  configLoaded = true;
  Serial.printf("Config sync OK. Versao %d, %d zonas\n", newVersion, config.zoneCount);
  showStatus("Config OK", String(newVersion) + " v" + String(config.zoneCount) + "z");
  return true;
}

// ============================================================
// TELEMETRIA
// ============================================================

bool sendTelemetryToApi() {
  if (!hasDeviceCredentials()) {
    return false;
  }
  HTTPClient http;
  if (!beginHttp(http, "/devices/" + deviceId + "/telemetry")) {
    lastHttpCode = 0;
    return false;
  }
  http.addHeader("Content-Type", "application/json");
  addDeviceAuthHeader(http);
  StaticJsonDocument<4096> doc;
  // Agregado legado; automacao e interface usam as leituras dentro de zones.
  doc["soilMoisture"] = soilMoisture;
  doc["pumpOn"] = pumpOn;
  doc["firmwareTimestampMs"] = millis();
  doc["rssi"] = WiFi.RSSI();
  doc["lastIp"] = WiFi.localIP().toString();
  doc["uptimeSeconds"] = (millis() - bootTimeMs) / 1000;
  doc["firmwareVersion"] = "1.5.0";
  if (config.zoneCount > 0) {
    JsonArray zonesArray = doc.createNestedArray("zones");
    for (int i = 0; i < config.zoneCount; i++) {
      JsonObject z = zonesArray.createNestedObject();
      int stateIdx = zoneIndexToStateIndex(config.zones[i].index);
      z["zoneIndex"] = config.zones[i].index;
      z["desiredState"] = config.zones[i].desiredState;
      z["confirmedState"] = "UNAVAILABLE";
      if (isValidHaraPortIndex(config.zones[i].index) &&
          zoneSoilMoisture[config.zones[i].index] >= 0) {
        z["soilMoisture"] = zoneSoilMoisture[config.zones[i].index];
      }
      if (stateIdx >= 0) {
        z["appliedState"] = zoneStates[stateIdx].appliedState;
        if (zoneStates[stateIdx].currentAngle >= 0) {
          z["servoAngle"] = zoneStates[stateIdx].currentAngle;
        }
      } else {
        z["appliedState"] = "UNKNOWN";
      }
    }
  }
  String body;
  serializeJson(doc, body);
  int code = http.POST(body);
  lastHttpCode = code;
  http.end();
  if (code == 201) {
    apiReady = true;
    return true;
  }
  apiReady = false;
  Serial.printf("Falha no envio de telemetria. HTTP %d\n", code);
  recoverDeviceRegistration(code, "Telemetria");
  return false;
}

// ============================================================
// COMANDOS
// ============================================================

bool checkPendingCommands() {
  if (!hasDeviceCredentials() || !configLoaded) {
    return false;
  }
  HTTPClient http;
  if (!beginHttp(http, "/devices/" + deviceId + "/commands/pending")) {
    lastHttpCode = 0;
    return false;
  }
  addDeviceAuthHeader(http);
  int code = http.GET();
  lastHttpCode = code;
  if (code != 200) {
    http.end();
    recoverDeviceRegistration(code, "Comandos");
    return false;
  }
  String response = http.getString();
  http.end();
  DynamicJsonDocument doc(4096);
  DeserializationError error = deserializeJson(doc, response);
  if (error) {
    return false;
  }
  // Handle both new (success.data.commands) and legacy (commands) formats
  JsonArray commands;
  if (doc["success"] == true && !doc["data"]["commands"].isNull()) {
    commands = doc["data"]["commands"].as<JsonArray>();
  } else {
    commands = doc["commands"].as<JsonArray>();
  }
  if (commands.isNull() || commands.size() == 0) {
    return true;
  }
  for (JsonObject cmd : commands) {
    const char* cmdId = cmd["id"];
    const char* cmdType = cmd["type"];
    if (cmdId == nullptr || cmdType == nullptr) {
      Serial.println("Comando ignorado: id ou tipo ausente.");
      continue;
    }
    JsonObject payload = cmd["payload"];
    restartRequested = false;
    lastCommandFailureReason = "";
    bool repeated = commandAlreadyCompleted(String(cmdId));
    bool success = true;
    if (repeated) {
      Serial.printf("Comando %s ja executado; reenviando apenas a confirmacao.\n", cmdId);
    } else {
      success = executeCommand(cmdType, payload);
      if (success && commandChangesPhysicalOutput(cmdType)) {
        // Persiste antes do ACK: se a rede cair, o comando reenviado nao move o hardware de novo.
        rememberCompletedCommand(String(cmdId));
      }
    }
    String failReason = lastCommandFailureReason.length() > 0
      ? lastCommandFailureReason
      : "Falha na execucao";
    bool acknowledged = acknowledgeCommand(cmdId, success, success ? "" : failReason);
    if (success && acknowledged && restartRequested) {
      delay(500);
      ESP.restart();
    }
  }
  return true;
}

bool executeCommand(const char* type, JsonObject payload) {
  Serial.printf("Executando comando: %s\n", type);
  if (strcmp(type, "SYNC_CONFIG") == 0) {
    bool synced = syncConfigFromApi();
    if (!synced) {
      lastCommandFailureReason = "Falha ao sincronizar configuracao";
    }
    return synced;
  }
  if (strcmp(type, "RESTART") == 0) {
    restartRequested = true;
    return true;
  }
  if (strcmp(type, "PUMP_ON") == 0) {
    bool manualCycle = payload["manualCycle"] | false;
    if (!manualCycle) {
      config.pumpMode = "FORCED_ON";
    } else {
      manualPumpHoldOff = false;
    }
    setPump(irrigationPathIsSafe());
    if (!pumpOn) {
      lastCommandFailureReason = "Nenhum registro aberto para ligar a bomba";
    }
    return pumpOn;
  }
  if (strcmp(type, "PUMP_OFF") == 0) {
    setPump(false);
    bool manualCycle = payload["manualCycle"] | false;
    if (!manualCycle) {
      config.pumpMode = "FORCED_OFF";
    } else {
      manualPumpHoldOff = true;
    }
    return true;
  }
  if (strcmp(type, "OPEN_ZONE") == 0 && !payload.isNull()) {
    int zoneIndex = payload["zoneIndex"] | -1;
    if (zoneIndex >= 0 && setZoneDesiredState(zoneIndex, "OPEN")) {
      int stateIdx = findZoneStateIndex(zoneIndex);
      if (stateIdx >= 0) {
        zoneStates[stateIdx].manualOverride = true;
        zoneStates[stateIdx].automationIrrigating = false;
        zoneStates[stateIdx].drySinceAt = 0;
      }
      applyZonesFromConfig();
      applyPumpSafety();
      return waitForZoneMovement(zoneIndex);
    }
    lastCommandFailureReason = "Area invalida ou sem atuador configurado";
    return false;
  }
  if (strcmp(type, "CLOSE_ZONE") == 0 && !payload.isNull()) {
    int zoneIndex = payload["zoneIndex"] | -1;
    if (zoneIndex >= 0 && setZoneDesiredState(zoneIndex, "CLOSED")) {
      int stateIdx = findZoneStateIndex(zoneIndex);
      if (stateIdx >= 0) {
        zoneStates[stateIdx].manualOverride = false;
        zoneStates[stateIdx].automationIrrigating = false;
        zoneStates[stateIdx].drySinceAt = 0;
        zoneStates[stateIdx].lastIrrigationEndedAt = millis();
      }
      applyZonesFromConfig();
      applyPumpSafety();
      bool moved = waitForZoneMovement(zoneIndex);
      if (moved) {
        manualPumpHoldOff = false;
      }
      return moved;
    }
    lastCommandFailureReason = "Area invalida ou sem atuador configurado";
    return false;
  }
  if (strcmp(type, "TEST_ZONE") == 0 && !payload.isNull()) {
    int zoneIndex = payload["zoneIndex"] | -1;
    if (zoneIndex < 0) {
      lastCommandFailureReason = "Area invalida para teste";
      return false;
    }
    return testZoneServo(zoneIndex);
  }
  if (strcmp(type, "OTA_UPDATE") == 0) {
    Serial.println("OTA_UPDATE nao implementado neste firmware.");
    lastCommandFailureReason = "Atualizacao OTA nao implementada";
    return false;
  }
  Serial.printf("Tipo de comando desconhecido: %s\n", type);
  lastCommandFailureReason = "Tipo de comando desconhecido";
  return false;
}

