AlexandreAbreuCzr/HaraTech/esp32codes/initial/initial.ino
bool acknowledgeCommand(const char* commandId, bool success, const String& failReason) {
  if (!hasDeviceCredentials()) {
    return false;
  }
  StaticJsonDocument<256> doc;
  doc["success"] = success;
  if (!success && failReason.length() > 0) {
    doc["failReason"] = failReason;
  }
  String body;
  serializeJson(doc, body);

  for (uint8_t attempt = 0; attempt < COMMAND_ACK_MAX_ATTEMPTS; attempt++) {
    HTTPClient http;
    if (beginHttp(http, "/devices/" + deviceId + "/commands/" + String(commandId) + "/ack")) {
      http.addHeader("Content-Type", "application/json");
      addDeviceAuthHeader(http);
      int code = http.POST(body);
      lastHttpCode = code;
      http.end();
      if (code == 200) {
        return true;
      }
    } else {
      lastHttpCode = 0;
    }

    if (attempt + 1 < COMMAND_ACK_MAX_ATTEMPTS) {
      delay(COMMAND_ACK_RETRY_DELAY_MS);
    }
  }

  return false;
}

// ============================================================
// DISPLAY
// ============================================================

void updateDisplay() {
  String line1;
  if (config.zoneCount <= 0) {
    line1 = "Sem areas";
  } else {
    if (displayZoneCursor >= config.zoneCount) {
      displayZoneCursor = 0;
    }
    ZoneCfg& zone = config.zones[displayZoneCursor];
    int moisture = isValidHaraPortIndex(zone.index)
      ? zoneSoilMoisture[zone.index]
      : -1;
    int stateIdx = findZoneStateIndex(zone.index);
    String servoState = stateIdx >= 0 && zoneStates[stateIdx].targetState == "OPEN"
      ? "ABR"
      : "FCH";
    line1 = "S" + String(zone.index + 1);
    if (moisture >= 0) {
      line1 += " U:" + String(moisture) + "% ";
    } else {
      line1 += " SENSOR OFF ";
    }
    line1 += servoState;
    displayZoneCursor = (displayZoneCursor + 1) % config.zoneCount;
  }

  String line2;
  if (WiFi.status() != WL_CONNECTED) {
    line2 = "WiFi offline";
  } else if (!hasDeviceCredentials()) {
    line2 = "Sem registro";
  } else if (!apiReady) {
    line2 = "API HTTP " + String(lastHttpCode);
  } else {
    line2 = pumpOn ? "B:ON  WiFi:OK" : "B:OFF WiFi:OK";
  }
  showStatus(line1, line2);
}

// ============================================================
// SETUP
// ============================================================

void setupWatchdog() {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t wdtConfig;
  wdtConfig.timeout_ms = WDT_TIMEOUT_SEC * 1000;
  wdtConfig.idle_core_mask = 0;
  wdtConfig.trigger_panic = true;
  esp_err_t result = esp_task_wdt_reconfigure(&wdtConfig);
  if (result == ESP_ERR_INVALID_STATE) {
    result = esp_task_wdt_init(&wdtConfig);
  }
#else
  esp_err_t result = esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif
  if (result != ESP_OK && result != ESP_ERR_INVALID_STATE) {
    Serial.printf("Falha ao configurar watchdog: %d\n", result);
  }
  if (esp_task_wdt_status(NULL) != ESP_OK) {
    esp_task_wdt_add(NULL);
  }
}

void setup() {
  // Desliga o rele antes de inicializar display, Serial ou Wi-Fi.
  pinMode(PUMP_RELAY_PIN, OUTPUT);
  setPump(false);

  Serial.begin(115200);
  lcd.begin(16, 2);
  showStatus("Hara Tech", "Inicializando");

  for (int i = 0; i < HARA_PORT_COUNT; i++) {
    pinMode(SOIL_SENSOR_GPIO_PINS[i], INPUT);
    analogSetPinAttenuation(SOIL_SENSOR_GPIO_PINS[i], ADC_11db);
  }
  analogReadResolution(12);

  chipId = getChipId();
  loadCredentials();
  loadCompletedCommands();
  bootTimeMs = millis();
  connectWifiPortal();
  if (WiFi.status() == WL_CONNECTED) {
    ensureDeviceRegistered();
    sendHeartbeat();
    syncConfigFromApi();
  }

  // O portal do WiFiManager pode ficar aberto por ate 180 segundos.
  // Ative o watchdog somente depois dele terminar para evitar reinicios
  // enquanto o usuario informa a rede Wi-Fi.
  setupWatchdog();
}

// ============================================================
// LOOP PRINCIPAL
// ============================================================

void loop() {
  unsigned long now = millis();

  updateServoMovements(now);
  maintainWifi();
  if (WiFi.status() == WL_CONNECTED) {
    ensureDeviceRegistered();
  }

  if (now - lastSensorReadAt >= SENSOR_INTERVAL_MS) {
    lastSensorReadAt = now;
    readConfiguredSoilMoisture();
    applyIrrigationControl();
    applyPumpSafety();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastHeartbeatAt >= (unsigned long)config.heartbeatIntervalSeconds * 1000) {
    lastHeartbeatAt = now;
    sendHeartbeat();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastConfigSyncAt >= (unsigned long)config.configSyncIntervalSeconds * 1000) {
    lastConfigSyncAt = now;
    syncConfigFromApi();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastTelemetryAt >= (unsigned long)config.telemetryIntervalSeconds * 1000) {
    lastTelemetryAt = now;
    sendTelemetryToApi();
  }

  if (WiFi.status() == WL_CONNECTED &&
      hasDeviceCredentials() &&
      now - lastCommandPollAt >= COMMAND_INTERVAL_MS) {
    lastCommandPollAt = now;
    checkPendingCommands();
  }

  if (now - lastDisplayAt >= DISPLAY_INTERVAL_MS) {
    lastDisplayAt = now;
    updateDisplay();
  }

  esp_task_wdt_reset();
}
